const targetWords = [
  "ագռավ", "ազնիվ", "ախպեր", "եղնիկ", "բժիշկ", "փունջ", "քաղցր", "տանգո", "գնում", "սոխակ", "լավաշ", "բոբիկ", "ընկեր", "թթենի", "երգիչ", "համեմ", "շնչել", "գազար", "դրախտ", "բույս", "քույր", "ծաղիկ", "տատիկ", "ջրվեժ", "սնդիկ", "բալիկ", "սուրճ", "շաքար", "ուժեղ", "միտքը", "կոճակ", "կատակ", "կարոտ", "լողափ", "գույն", "կանոն", "լույս", "կոշիկ", "աշուն", "երեկո", "կատու", "պակաս", "ծիրան", "աղջիկ", "պանիր", "իմաստ", "բարիք", "հեռու", "իշխան", "թզուկ", "բրինձ", "կարմիր", "դեղին", "կապիկ", "գազան", "թիթեռ", "մկրատ", "մեղու", "նախնի", "գավաթ", "արծիվ", "համեղ", "ձողիկ", "պարան", "գնդակ", "ապակի", "լեզու", "պղինձ", "երևան", "ածուխ", "հավատ", "պարապ", "կոլոտ", "կանաչ", "անհատ", "կտցար", "կույր", "ականջ", "բանան", "դժվար", "հալել", "դարակ", "թիթեռ", "արաքս", "ծավալ", "բարակ", "հաճար", "թենիս", "ասպետ", "կացին", "անձրև", "արժեք", "պնդել", "երթալ", "տանիք", "տապան", "լազեր", "անուն", "փախել", "բոյով", "դարեր", "ավանդ", "արարք", "կաստա", "քվարկ", "մարել", "օպերա", "ծարավ", "զոդել", "ուղեղ", "դդում", "եղևնի", "օրենք", "զորեղ", "վազել", "կայսր", "կեռաս", "բարձր", "թռչող", "խաղող", "աքլոր", "մնում", "հալեպ", "բաշար", "հյուր", "քարոզ", "կարիճ", "աղվես", "սույն", "արճիճ", "ճիճու", "մալթա", "մունջ", "նադիր", "հագագ", "հաիթի", "զննել", "բառեր", "համառ", "սկիզբ", "խոսեց", "հավան", "դպրոց", "վճռել", "տապար", "հատակ", "միմոս", "կոշիկ", "կարող", "բարդի", "սպասք", "քաղաք", "անուր", "տոկոս", "հեղեղ", "լողալ", "պտուկ", "կճուճ", "ավլել", "ցնորք", "հասու", "քաղցր", "լույս", "հաշվի", "սիրել", "կրկին", "քամել", "բերել", "միջեվ", "սյուն", "հատիկ", "մինչև", "բետոն", "անտառ", "հիշեց", "վոկալ", "ծիրան", "թառել", "երաշտ", "րաբբի", "քերել", "տակառ", "սափոր", "հաշիշ", "աշուն", "մետաղ", "հյութ", "ջրպան", "գալիք", "պաչիկ", "չվերթ", "ծորալ", "կապիկ", "սրբան", "ակնոց", "հերթը", "ճաքել", "զգաստ", "գազան", "ուզել", "դանակ", "պեդալ", "վառիչ", "սեզոն", "հատոր", "պակաս", "պատիժ", "խորան", "տեսակ", "նավակ", "ապրել", "սուրբ", "փարոս", "երեկո", "ճագար", "իմաստ", "հղում", "մուշկ", "մոդել", "պիցցա", "կապար", "գավաթ", "սմբակ", "զգացի", "ատլաս", "չոփիկ", "թույլ", "մոծակ", "հեռու", "քարեր", "կրվել", "պզուկ", "տխմար", "խաղեր", "բյուր", "կշեռք", "երկու", "միջով", "բորակ", "ուստր", "աչքեր", "որսալ", "զնջիլ", "յասախ", "մկնիկ", "ռետին", "ըլլալ", "քանան", "կենաց", "որտեղ", "տունկ", "ոտնակ", "գալիս", "չնչին", "զավակ", "խոշոր", "մանրէ", "վերին", "հեթիթ", "պատառ", "երկար", "նզովք", "սոֆիա", "ուստի", "սումո", "մրրիկ", "շիրիմ", "ձկներ", "ոսկյա", "հասցե", "բողոք", "անգամ", "բանկա", "ջոկատ", "պղինձ", "ռադար", "աղոթք", "մայիս", "կեռիկ", "մրցել", "չինար", "կատու", "ռոման", "հավես", "կրծող", "եռանդ", "ինչու", "թզուկ", "մեդալ", "ընկել", "աղուն", "կողով", "ներել", "բրինձ", "մասիս", "ստեղն", "մազոտ", "բարիք", "զիջող", "դատել", "բերան", "ողբալ", "շապիկ", "նպաստ", "սովոր", "դույլ", "քավել", "նախնի", "հասել", "ճզմել", "լրտես", "մոխիր", "շիրազ", "հատու", "կավատ", "սկսած", "մուրց", "էկրան", "թրջել", "վոլգա", "եզերք", "ռիցին", "վահան", "ընտիր", "գագաթ", "իներտ", "նարդի", "չղջիկ", "նեպալ", "ընդէր", "մարքս", "խմբեր", "երեխա", "էական", "տառեխ", "սկսեց", "սալաթ", "տավար", "ուրիշ", "արծաթ", "տվյալ", "կրկես", "սրտյա", "կարծր", "քնում", "նստել", "ուղիղ", "բացել", "տեսիլ", "կաննե", "չեզոք", "մարած", "չալմա", "սրճել", "տարափ", "այրոց", "փշուր", "մշուշ", "թակոց", "ջրարջ", "հիշել", "հավաք", "սուվա", "կաղին", "քշում", "շուրջ", "ցերեկ", "զառիկ", "տավիղ", "ապշած", "մողես", "դժոխք", "պոկեր", "նավազ", "մառան", "սիլոս", "խունկ", "հիրել", "տաշել", "ոսկոր", "արծիվ", "կաքավ", "սեմիտ", "նիզակ", "շաղափ", "նիկել", "թոքեր", "սպորտ", "հերոս", "կեսար", "քանոն", "երկիր", "քյոլն", "այսօր", "թիրախ", "ճիրան", "կարշն", "ժիլետ", "բիբար", "խստիվ", "հերաթ", "չարիք", "դնում", "մինսկ", "փարիզ", "մորթի", "ոչինչ", "զգեստ", "կարիք", "կարստ", "ուելս", "պատիկ", "բարով", "բրոնզ", "խնդիր", "հնդիկ", "համեղ", "տրոյա", "նոտար", "սպիրտ", "իլենի", "հատել", "ցավել", "հաջող", "ձյուն", "ջերսի", "կիսեց", "ջադու", "բույր", "հինդի", "ուրիշ", "շուշտ", "չոլստ", "ճոպան", "համոզ", "պունշ", "հալվե", "ներկա", "առողջ", "փչում", "ջուբա", "պարել", "բանակ", "ռաբիզ", "լորիկ", "հստակ", "ճակատ", "հետին", "խալաթ", "բորան", "շինել", "մայլա", "հաղբք", "ցիգան", "ժպտալ", "մրսել", "հորու", "հռչակ", "կլուբ", "թրմել", "տկլոր", "տոկիո", "ցավոտ", "կրպակ", "փորել", "վհուկ", "ձերով", "փորոք", "սփռել", "սունկ", "կոտոր", "միջոց", "պոչատ", "ճոկան", "քամոց", "լվացք", "հաչան", "կոպեկ", "շալոմ", "նռնակ", "ուշու", "դնչիկ", "մատիտ", "պույտ", "խարամ", "նիհար", "ունակ", "թուղթ", "ջրհոս", "անթիվ", "տեղիք", "տոնել", "բլուր", "շերեփ", "հասած", "նշանը", "արխիվ", "պոլկա", "խնձոր", "սիլվա", "զենիթ", "հիմար", "անութ", "գամետ", "բամիա", "տաբատ", "պաշար", "գորկի", "ղազախ", "երկաթ", "արդեն", "չափար", "մեկին", "տները", "անզգա", "սանիկ", "արձան", "տարիք", "ավելի", "հաճախ", "լոտոս", "գծուծ", "մյուս", "կաթիլ", "դիանա", "պահել", "արման", "կակաչ", "լողակ", "ապուր", "միջին", "անմեռ", "չոբան", "ուրալ", "ուլիկ", "փապար", "ուղիղ", "ուղեղ", "բոզոն", "ցամաք", "կռնակ", "հասակ", "երևան", "հովիտ", "թայֆա", "մուղտ", "քիմիա", "սոուս", "պոպոք", "կաղնի", "դայակ", "աղքատ", "կարատ", "շյուղ", "կավիճ", "կայքը", "դեղոտ", "կմախք", "պեկին", "բանջո", "որքան", "ունակ", "կամար", "վառել", "կամաց", "ռադիո", "ձողիկ", "ուրախ", "ծալել", "հունձ", "պղպեղ", "որքին", "գիշեր", "նուգա", "կապան", "ռեհան", "կանեփ", "հնոտի", "պիրոլ", "դեղին", "վեզիր", "կարեն", "ուտել", "վարազ", "վիենա", "հովազ", "գունդ", "զառամ", "հիդրա", "ճահիճ", "խաղաղ", "արդար", "քաչալ", "հայոց", "գրքեր", "սրիկա", "նամակ", "թզենի", "ուզել", "չփլախ", "տուրք", "թռիչք", "զիբիլ", "կորիզ", "ծանակ", "քունք", "կտրոն", "հմայք", "կորեկ", "տիտան", "մայրի", "պիտակ", "նշում", "սամբո", "կեսօր", "ճաղատ", "կակաո", "մատաղ", "սնոտի", "մլուկ", "սոլոն", "կարին", "լսում", "մասոն", "ջահել", "շրջել", "ձգում", "վասալ", "տեքստ", "վառոդ", "գտնել", "լոլիկ", "երինջ", "չորոց", "գնդակ", "պերու", "լոբբի", "կոտեմ", "պաչել", "սողալ", "սառած", "ձգվել", "հոտաղ", "սորոս", "թվինզ", "թույն", "մերով", "մրուր", "վրացի", "նաջար", "ուստի", "մեքքա", "մղմող", "խույր", "խեչակ", "գցվող", "ռուան", "հիթեր", "պուտչ", "ռադոն", "պարան", "կուշտ", "պրայա", "ուլիկ", "նմուշ", "ճյուղ", "սենատ", "տիկին", "խշտիկ", "եզակի", "ծնված", "հակոբ", "հունդ", "ցուրտ", "կակալ", "հենան", "հոսքը", "սամբա", "զապել", "գավառ", "նեխել", "անոթի", "գնացք", "գիտեմ", "կլիմա", "պագել", "հույն", "շոֆեր", "կնքել", "դուրս", "մորեխ", "զարին", "թորոս", "անդեր", "փորձը", "սրճեփ", "խոսել", "եփրատ", "մուտք", "մակաո", "կռածո", "սիրիա", "սխտոր", "զնդան", "ճռնիկ", "կտուց", "կռռալ", "սիգար", "անմեղ", "հյուս", "ձույլ", "ապագա", "ձուղբ", "ռեպեր", "կայան", "սրբել", "դոշակ", "մասին", "մամբո", "մկրատ", "մեղու", "օմեգա", "լիմոն", "վարել", "հաճիս", "դիմակ", "գոմեշ", "համար", "գետեր", "կոնգո", "փսխել", "գարաժ", "թառամ", "ապրես", "քացախ", "ափսոս", "ռունգ", "գրպան", "թիմեր", "ողորկ", "ղասաբ", "ասվյա", "կարագ", "մենակ", "ճշտիվ", "հաշիվ", "պարոն", "գեղձի", "կարամ", "տափան", "սուտը", "եփուկ", "կպչել", "փայտե", "պոլաբ", "ոստրե", "մուրճ", "տաշեղ", "պտուղ", "գույք", "շշուկ", "նախիր", "ճկուն", "անգիր", "պապիկ", "թեսևս", "ապակի", "շլդիկ", "ուրֆա", "խնչել", "կիմեր", "պեննի", "ծարիր", "ռայան", "փառոք", "շփում", "նորեկ", "գոռալ", "աղջիկ", "մուսա", "հպարտ", "ֆոբիա", "հայֆա", "տաջիկ", "անհոգ", "վաննա", "խաբար", "հեծան", "աղցան", "հոգոց", "գուցե", "վարիչ", "դնեպր", "վրձին", "բալետ", "գետակ", "կարապ", "գտածո", "անդամ", "դրվատ", "գլուխ", "գոնադ", "մազեր", "գմբեթ", "կյանք", "սրբիչ", "կուռք", "ջնջոց", "շերիֆ", "սիլլա", "գետին", "գոհար", "ցխինք", "միլան", "խոնավ", "սրտեր", "խնամք", "փաթեթ", "դադար", "այրել", "դուքս", "սալոր", "հազար", "ուրան", "հաքեր", "մատակ", "կտուր", "կոպիտ", "գուրզ", "քարափ", "ծիծաղ", "նրանց", "մեռել", "ղարիշ", "տաճար", "դավոս", "հույս", "բաժին", "ննջել", "սիսեռ", "կետեր", "բաժակ", "շպրից", "սխեմա", "պարտք", "նինջա", "ձգտել", "տոլմա", "ջհուդ", "նևադա", "ղալաթ", "նորոգ", "տալիս", "գերան", "դագաղ", "կոկոս", "նշտար", "ջիգիթ", "մակն.", "նայեց", "երգել", "հրաշք", "դոգմա", "երանգ", "կարել", "տիբեթ", "ճպուռ", "ուռհա", "մտնել", "հազալ", "տիբեր", "ժողով", "սկսել", "հաչաղ", "հնչել", "շավիղ", "ապրիլ", "սերիա", "սեուլ", "ծամոն", "գեյշա", "միթամ", "ըմպել", "եռյակ", "նինվե", "զույգ", "կերել", "վիճակ", "տփղիս", "պառավ", "նայել", "ուրախ", "ստվար", "կնձնի", "փշրել", "քանակ", "լեզու", "զոմբի", "յալթա", "սապփո", "ձուկն", "արմատ", "խելոք", "սազել", "փակել", "սկոտչ", "թանաք", "խարզա", "հադես", "ծունկ", "դրվագ", "մաշնա", "ամուր", "գծանց", "չամիչ", "հռութ", "ձախող", "կոլաժ", "օծյալ", "մտրակ", "հորան", "կռնատ", "զատիկ", "վիշապ", "շքերթ", "ձագար", "դոլար", "լուրթ", "ռոմնի", "գյուտ", "հսկիչ", "տուլա", "հումք", "տնտես", "սելեն", "սավան", "գյուղ", "ճաշել", "մղմեղ", "հոկեյ", "փական", "կռինչ", "գելոց", "էլզաս", "հոբոյ", "ամրոց", "ջնջել", "անրակ", "միջատ", "դասեր", "սոված", "ճամփա", "խնծիղ", "ծորան", "հրշեջ", "ցույց", "հոգնա", "միզել", "ոռնալ", "կիտել", "ելցին", "հոսել", "անդեմ", "կեցցե", "կույս", "նելլի", "նյութ", "կիսել", "միայն", "փրկել", "պոլիս", "տաքսի", "անում", "կաղաղ", "ուելս", "քավոր", "գնչու", "կվարց", "կռիչք", "ծանոթ", "շնչեղ", "շաշկի", "հրում", "կռվել", "գիսակ", "կվենի", "փույթ", "հոլով", "շուրթ", "ռաքել", "ոչխար", "փողոց", "թմբիր", "հովիվ", "անուշ", "տխուր", "սորալ", "ծիծակ", "լյարդ", "մոլոր", "նրանք", "ոհմակ", "պտտել", "էլիպս", "ստվեր", "անմահ", "կնճիռ", "իշղար", "սիբիր", "ռեգբի", "լացել", "ամպեր", "անկախ", "հրդեհ", "նաթան", "վաճառ", "սիրած", "չափել", "վաֆլի", "սրանք", "մռայլ", "կորեա", "մորու", "կնճիթ", "սակավ", "կուղբ", "դոնոր", "վայրի", "շեկել", "սասան", "եռակի", "մուկն", "վստահ", "կտրել", "նյարդ", "մնջիկ", "խումբ", "տեխաս", "զվարթ", "կուրս", "կոալա", "ծածան", "կրծել", "զգում", "ուրան", "շեփոր", "կուղխ", "դրացի", "կռճիկ", "սեղան", "մոդեմ", "քննել", "թռչել", "վիսլա", "նուրբ", "մոտիկ", "հունչ", "շակալ", "կսկիծ", "ռոբոտ", "դավիթ", "խաղալ", "տիպար", "կիթառ", "ուստր", "ստինք", "ոստան", "վիսկի", "կոտոշ", "դիետա", "տիրան", "մոլար", "ֆիզիկ", "ուրալ", "նետել", "պիթոն", "խրճիթ", "ռեժիմ", "վիրագ", "ելնել", "տոննա", "հուդա", "կորած", "լծորդ", "նկուղ", "հույր", "նշված", "հագած", "երևակ", "ձավար", "հրթիռ", "վենետ", "կիրով", "դռներ", "հարավ", "յաշիկ", "դունչ", "տողան", "խոզակ", "պատիվ", "նամազ", "խոզեր", "մասեր", "երբեք", "տիպիկ", "խորակ", "դաժան", "նշենի", "նոխազ", "պալատ", "եսայի", "դղորդ", "չաման", "նորից", "ույծք", "եկանք", "րաֆֆի", "դափնի", "եղինջ", "շնորհ", "սրինգ", "կոչել", "դալար", "տապեղ", "դիմել", "կախել", "կաթսա", "պարեր", "չպետք", "շուկա", "նիցշե", "վագոն", "շաբաթ", "շրջան", "ծնծղա", "սփռոց", "ուտել", "ծամել", "ծույլ", "երշիկ", "դանիա", "տափակ", "դղյակ", "սապոն", "ծովափ", "երասխ", "շփվել", "որյար", "տուղտ", "սիրող", "լուրջ", "դոնիկ", "դինար", "գտանք", "շունչ", "նույն", "եղյամ", "պանիր", "պրահա"],
        Ta = ["աբխազ", "աբորտ", "աբրամ", "ագուռ", "ուտիճ", "ադմին", "ադրիա", "ազդել", "ալժիր", "ալիբի", "ալինա", "ալկաշ", "ալպեր", "խոցել", "ածանց", "ածելի", "ակտեր", "երիցս", "կամավ", "ակտիվ", "աղանդ", "աղեղն", "աղերս", "դիվան", "կույտ", "կցորդ", "աղվաշ", "աղվոր", "թլփատ", "կարիա", "հալվա", "աճուկ", "աճում", "ամայի", "ամբար", "ամբոխ", "ամեհի", "ամուլ", "այլևս", "անալի", "առտու", "անարի", "անբիծ", "ցավոք", "հալոց", "անդյա", "անդրի", "անեծք", "անթեղ", "անժաժ", "մաֆիա", "կրետե", "մարատ", "վտանգ", "կալել", "տալով", "անիմե", "անկած", "մեռած", "անձավ", "անջատ", "անտեր", "լացող", "բոթել", "անցած", "անցել", "աշորա", "աոմին", "ապուշ", "ապտակ", "առանց", "առնել", "առնետ", "ասթմա", "ասորի", "ասուպ", "ասպար", "ասսամ", "ասվեղ", "աստատ", "ատաղձ", "ատամն", "ատկատ", "ատյան", "ատում", "արբել", "արգոն", "արգոս", "քաթար", "արմավ", "յարեն", "արշավ", "արսեն", "արտեմ", "ափիոն", "աքայա", "աքացի", "աֆղան", "յանկի", "ղափան", "բագաժ", "բազազ", "բակլա", "բաղեղ", "բաղչա", "բայախ", "ստերջ", "բայոց", "բանալ", "բանդա", "սորգո", "սիմոն", "բանել", "բանկլ", "բավիղ", "բաքու", "կճղակ", "գադես", "ձեզմէ", "մառոլ", "բդկել", "բեգեմ", "բելիզ", "կուբա", "զենոն", "նեղոս", "մեթոդ", "մանգա", "բեկոն", "բեկոր", "բենին", "բերեց", "բերրի", "բիզոն", "բիթլզ", "բիլակ", "բիհար", "բիրմա", "բխկալ", "մագիլ", "բոժոժ", "բոինգ", "բոլոր", "բոսոր", "բովել", "բորշչ", "բորոտ", "բորսա", "բոցել", "բույթ", "բույլ", "բույն", "բուշտ", "բուռն", "հայնե", "մագմա", "պեպեն", "բուստ", "բուրգ", "բուրդ", "բռնել", "բրդել", "բրդյա", "բրդոշ", "բրեստ", "բրուտ", "գաբոն", "գետտո", "գիլաս", "գլանդ", "գյոթե", "գները", "գրգիռ", "գրեթե", "գրելը", "գրենա", "գրում", "գևորգ", "դաբիր", "դակիա", "դաջել", "դավայ", "դարեհ", "դելտա", "դեկան", "դեֆիս", "դիեգո", "դիտել", "դոդոշ", "դուխի", "դումա", "եղեռն", "եղիշե", "էգուց", "էդգար", "էթիկա", "էղնել", "ըմբիշ", "թաթար", "թալան", "թալես", "թալիբ", "թաղել", "թանալ", "թանձր", "թառափ", "պողոս", "թավիշ", "թարախ", "թափել", "թափոն", "թեղոշ", "չարչի", "թեմզա", "թմրած", "մզկիթ", "թշշալ", "թշվառ", "թոթով", "թոխոր", "թոռոմ", "թովիչ", "թուլա", "թուխպ", "թուրմ", "թուրք", "թվանք", "թվիստ", "ժակետ", "ժանիք", "ժխտել", "իզմիր", "իթակե", "ինդոս", "իսլամ", "իրենց", "իրենք", "լակոտ", "լատիշ", "լենին", "լիանա", "լիբիա", "լիդիա", "լիզել", "լիկիա", "լինել", "լիսեռ", "լիվրե", "լիտվա", "յուան", "տեռոր", "լոզան", "լոսդի", "լումա", "բլթակ", "լույծ", "լուսն", "լքյալ", "լքված", "խաբել", "խալիֆ", "խայրի", "խաշել", "խաշու", "խաչել", "խառատ", "խավար", "խիզախ", "խղճալ", "խմիչք", "խոռոչ", "ռումբ", "ղսմաթ", "խուռն", "խուրձ", "ծեծել", "ծիծիկ", "ծխում", "ծղրիդ", "կաբել", "կադիս", "կրեմլ", "յասոն", "պսկով", "կազակ", "կազան", "կաթոդ", "ադանա", "աթենք", "ալբոմ", "ումբր", "ույծք", "ուշու", "ուռհա", "ուրֆա", "փարթի", "քակոր", "քամակ", "քաշել", "քաշեց", "քարոն", "քեմոն", "քենիա", "քինոտ", "քիրազ", "քծինք", "քծնել", "քծնող", "քոթոթ", "քոլեջ", "քոնլի", "քոչել", "քուրա", "քուրդ", "քուրջ", "քրքիջ", "օազիս", "օբամա", "օգնել", "օգուտ", "օդեսա", "ղայիշ", "օհայո", "օսկար", "օսման", "օրգան", "օրգիա", "օրդեր", "օրթախ", "օրիսա", "օքսիդ", "ֆերմա", "ֆիլիա", "ֆոնոն", "ֆոտոն", "ֆունտ", "ֆրանկ", "չիշիկ", "պամիր", "աբասի", "աբեղա", "աբուռ", "ագենտ", "ագռավ", "ազդակ", "ազնիվ", "աթլետ", "ալանի", "ալբան", "ալյակ", "ալվան", "ալրոտ", "ախմախ", "ախորժ", "ախպեր", "ածխոտ", "ածովի", "ածուխ", "ածվել", "ակամա", "ականթ", "ականջ", "ակնիկ", "ակնոց", "ակորդ", "ակութ", "ակրատ", "ակցիա", "ահալի", "ահյակ", "աղածո", "աղանձ", "աղացք", "աղբել", "աղբեր", "աղբոտ", "աղինճ", "աղինջ", "աղճատ", "աղոթք", "աղուն", "աղուտ", "աղուր", "աղջիկ", "աղջկա", "աղվան", "աղվես", "աղտոտ", "աղտոր", "աղցան", "աղքատ", "աճուն", "ամենք", "ամիրա", "ամլիկ", "ամյակ", "ամուր", "ամպել", "ամպեր", "ամպիկ", "ամպոտ", "ամռան", "ամրակ", "ամրան", "ամրոց", "ամփոփ", "այլոց", "այլոք", "այծիկ", "այսօր", "այտիկ", "այրել", "այրիչ", "այրոց", "անաղի", "անամպ", "անայգ", "անանց", "անաչք", "անարգ", "անբան", "անբառ", "անբավ", "անբեղ", "անբեր", "անբոց", "անգամ", "անգար", "անգեղ", "անգետ", "անգին", "անգիր", "անգոհ", "անդակ", "անդամ", "անդատ", "անդեղ", "անդեմ", "անդեպ", "անդող", "անեզր", "անեղծ", "անեցի", "անզգա", "անզեն", "անզոր", "անթաղ", "անթել", "անթեմ", "անթեփ", "անթիվ", "անթոց", "անժամ", "անլար", "անլաց", "անլվա", "անխաբ", "անխաշ", "անխաչ", "անխավ", "անխնա", "անխոհ", "անխոս", "անխոց", "անծալ", "անծախ", "անծեփ", "անծիլ", "անծին", "անծիր", "անծոտ", "անծոր", "անկաթ", "անկախ", "անկամ", "անկան", "անկապ", "անկար", "անկոթ", "անկոխ", "անկոչ", "անկոփ", "անհագ", "անհալ", "անհաճ", "անհամ", "անհաս", "անհատ", "անհաց", "անհետ", "անհեր", "անհոգ", "անհոդ", "անհող", "անհոտ", "անձեռ", "անղեկ", "անճաշ", "անճառ", "անճար", "անմազ", "անմահ", "անմաշ", "անմաս", "անմար", "անմեղ", "անմեռ", "անմիտ", "անմոռ", "անշահ", "անշառ", "անշեղ", "անշեն", "անշեջ", "անշող", "անոթի", "անոտք", "անութ", "անուժ", "անուն", "անուշ", "անուս", "անուր", "անչար", "անչափ", "անպոզ", "անպոչ", "անջիլ", "անջիղ", "անսազ", "անսեռ", "անսեր", "անսպի", "անվախ", "անվակ", "անվան", "անվար", "անվեճ", "անվկա", "անտակ", "անտաշ", "անտառ", "անտես", "անտիկ", "անտիպ", "անրակ", "անցան", "անցավ", "անցար", "անփակ", "անփառ", "անփող", "անքակ", "անքաղ", "անքաշ", "անքար", "անքեն", "անքիս", "աշխետ", "աշխօր", "աշնան", "աշուղ", "աշուն", "աորտա", "ապագա", "ապակի", "ապառք", "ապշել", "ապուռ", "ապուր", "ապսիդ", "ապրել", "ապրիլ", "առաջի", "առաջք", "առլեզ", "առկախ", "առկող", "առողջ", "առում", "առվակ", "ասացի", "ասիկա", "ասինք", "ասլան", "ասպետ", "ասված", "ասվեի", "ասվել", "ասվեմ", "ասվեն", "ասվես", "ասվեր", "ասվեց", "ասվեք", "ասվյա", "ասվող", "աստառ", "ավանդ", "ավանս", "ավարա", "ավարտ", "ավելի", "ավլել", "ավշակ", "ատելի", "ատլաս", "արաբա", "արանք", "արարք", "արբած", "արդար", "արդեն", "արժան", "արժել", "արժեք", "արինճ", "արինք", "արխիվ", "արծաթ", "արծիվ", "արկած", "արկան", "արձակ", "արձան", "արճիճ", "արմատ", "արմեն", "արնոտ", "արշին", "արջառ", "արվան", "արվել", "արտել", "արփիկ", "արքատ", "ափեզր", "ափկալ", "ափկից", "ափսոս", "աքլոր", "աքսոր", "աքցան", "բաբախ", "բաբան", "բագին", "բադամ", "բադան", "բադիկ", "բադյա", "բազար", "բազիս", "բաթաթ", "բաժակ", "բաժան", "բաժին", "բալամ", "բալետ", "բալիկ", "բալիշ", "բախել", "բախոց", "բահրա", "բամիա", "բայազ", "բայել", "բանակ", "բանան", "բանգի", "բանկա", "բառաչ", "բավել", "բարակ", "բարդի", "բարիք", "բարձր", "բարոն", "բարով", "բարոք", "բացատ", "բացել", "բացիլ", "բացիկ", "բաքոս", "բեգար", "բեկել", "բեհեզ", "բեղիկ", "բետոն", "բերան", "բերավ", "բերել", "բերին", "բերիր", "բերիք", "բզզալ", "բզզան", "բզզոց", "բժիշկ", "բիբար", "բլանդ", "բլանկ", "բլթել", "բլուզ", "բլուլ", "բլուր", "բլրակ", "բլրիկ", "բլրոտ", "բխկոց", "բկլատ", "բկլիկ", "բղղալ", "բղղոց", "բնազդ", "բնդել", "բնդեռ", "բնդիռ", "բնդոց", "բնկալ", "բնորդ", "բշտել", "բշտոտ", "բոբիկ", "բոբոխ", "բոբող", "բոխչա", "բոկեղ", "բողոճ", "բողոք", "բոճակ", "բոռալ", "բոռեխ", "բոռոց", "բորակ", "բորան", "բոցեղ", "բոցոտ", "բուղա", "բումբ", "բույս", "բույր", "բուրջ", "բոքոն", "բռինչ", "բռնակ", "բռնչի", "բռռալ", "բռռոց", "բտում", "բտվել", "բրածո", "բրդոտ", "բրինձ", "բրոնզ", "գագաթ", "գագար", "գազան", "գազար", "գազել", "գազոն", "գազպա", "գալար", "գալիք", "գալլա", "գաճաճ", "գամել", "գամիկ", "գամմա", "գամփռ", "գանել", "գաջել", "գաջոտ", "գավաթ", "գավակ", "գավառ", "գավիթ", "գավին", "գարաժ", "գգվել", "գեհեն", "գեղմն", "գետակ", "գետառ", "գետափ", "գետին", "գերաճ", "գերան", "գերել", "գերիչ", "գզում", "գզվել", "գզրար", "գզրոց", "գժվել", "գինով", "գինոտ", "գիշեր", "գիջին", "գիսակ", "գիտակ", "գլդոն", "գլխատ", "գլխել", "գլխիկ", "գլխոց", "գլուլ", "գլուխ", "գխտար", "գխտոր", "գծում", "գծվել", "գհուկ", "գղթոր", "գղձիկ", "գմբեթ", "գմփալ", "գմփել", "գմփոց", "գյուղ", "գյուտ", "գնացք", "գնդակ", "գնդել", "գնդիկ", "գնորդ", "գնում", "գնչու", "գնվել", "գոգել", "գոզալ", "գոհար", "գողոն", "գողտր", "գոճան", "գոմել", "գոմեշ", "գոչել", "գոչոց", "գոռալ", "գոռեխ", "գոռոզ", "գոռոց", "գովել", "գոտիկ", "գորով", "գոցել", "գուղձ", "գույժ", "գույն", "գույք", "գունդ", "գուռզ", "գուրզ", "գուցե", "գչրակ", "գչրել", "գջլել", "գռում", "գռռալ", "գռռոց", "գռփել", "գռփիչ", "գվվալ", "գտանք", "գտնել", "գրախտ", "գրաստ", "գրբաց", "գրգլի", "գրգոտ", "գրկել", "գրչակ", "գրպան", "գրված", "գրվան", "գրվել", "գցում", "գցված", "դաբաղ", "դագաղ", "դադար", "դաժան", "դալալ", "դալար", "դակել", "դակիչ", "դահիճ", "դաղել", "դամար", "դայակ", "դանակ", "դառած", "դառան", "դասակ", "դասել", "դաստա", "դավել", "դատել", "դարակ", "դարան", "դարափ", "դարձա", "դափնի", "դդմակ", "դդմաճ", "դդմել", "դդում", "դեղել", "դեղին", "դեղոտ", "դեսից", "դզզոց", "դզում", "դժգոհ", "դժժալ", "դժժոց", "դժխեմ", "դժկամ", "դժմիտ", "դժնիկ", "դժնյա", "դժոխք", "դժվար", "դիետա", "դիզել", "դիմակ", "դիմաց", "դիմել", "դինար", "դիպակ", "դիպան", "դիվոտ", "դիտակ", "դխկալ", "դխկոց", "դղիրդ", "դղյակ", "դղորդ", "դմբալ", "դմբոց", "դմփալ", "դմփել", "դմփիկ", "դմփոց", "դնգալ", "դնգոց", "դնդալ", "դնդեղ", "դնչիկ", "դշխեմ", "դոգմա", "դոլար", "դողալ", "դողել", "դողիկ", "դողոց", "դոնոր", "դորակ", "դույլ", "դունչ", "դուռն", "դուրգ", "դուրս", "դուքս", "դոփել", "դոփոց", "դպրոց", "դռնակ", "դռռալ", "դռռան", "դռռոց", "դրախմ", "դրախտ", "դրածո", "դրամա", "դրանց", "դրանք", "դրացի", "դրդել", "դրդիչ", "դրեցի", "դրըխկ", "դրժել", "դրինդ", "դրինք", "դրկից", "դրոշմ", "դրսեկ", "դրվագ", "դրված", "դրվել", "դրվեց", "դրվող", "եզակի", "եզակն", "եզերք", "եզվիտ", "եզրակ", "եզրիկ", "եթերք", "ելլել", "ելման", "ելնել", "եկչել", "եկվոր", "եղալի", "եղանք", "եղեգն", "եղերգ", "եղերդ", "եղինջ", "եղծել", "եղծիչ", "եղյամ", "եղնիկ", "եղուկ", "եռաթի", "եռաձի", "եռանդ", "եռաչք", "եռման", "եռյակ", "եռում", "երանգ", "երանի", "երանք", "երաշտ", "երգել", "երգիչ", "երդիկ", "երեխա", "երեկո", "երթալ", "երինջ", "երկաթ", "երկան", "երկար", "երկբա", "երկիր", "երկձի", "երշիկ", "եփվել", "զաման", "զամշե", "զառամ", "զառիկ", "զավակ", "զատել", "զատիչ", "զգաստ", "զգեստ", "զեբրա", "զեղել", "զենիթ", "զեռալ", "զզվել", "զիբիլ", "զինել", "զիջել", "զխկալ", "զխկել", "զղջալ", "զմփալ", "զմփոց", "զնգալ", "զնգոց", "զնդան", "զննել", "զոդել", "զոդիչ", "զոլել", "զոհել", "զոռել", "զոռով", "զորել", "զորեղ", "զույգ", "զուսպ", "զուրկ", "զսպան", "զսպել", "զսպիչ", "զվարթ", "զտում", "զտվել", "զրընգ", "զրկել", "զօծել", "էաբան", "էական", "էանալ", "էապես", "էդպես", "էդտեղ", "էդքան", "էթնիկ", "էլիտա", "էկրան", "էնպես", "էնտեղ", "էնքան", "էոլիթ", "էսչափ", "էսպես", "էստեղ", "էստոն", "էսքան", "էսքիզ", "էտում", "էտվոր", "էտքան", "էրինջ", "էրոցք", "էրվել", "էֆեկտ", "ըղձալ", "ըմպակ", "ըմպան", "ըմպել", "ընկած", "ընկան", "ընկավ", "ընկար", "ընկաք", "ընկեր", "ընչեղ", "ընտիր", "թաբախ", "թազբե", "թաթառ", "թաթիկ", "թալակ", "թախիծ", "թակել", "թակիչ", "թակոց", "թաղիք", "թաղյա", "թամահ", "թամամ", "թանաք", "թառակ", "թառամ", "թառել", "թառմա", "թասակ", "թասիբ", "թավալ", "թավշե", "թավոտ", "թարեք", "թացան", "թացոտ", "թափան", "թափառ", "թափով", "թափոր", "թելել", "թելիկ", "թեյել", "թեյին", "թենիս", "թերաճ", "թեփիկ", "թեփոտ", "թեքատ", "թեքել", "թզենի", "թզկել", "թզուկ", "թթախտ", "թթենի", "թթվաշ", "թթվել", "թիթեղ", "թիթեռ", "թիթիզ", "թիմոլ", "թիրախ", "թլվատ", "թխակն", "թխենի", "թխլիկ", "թխկալ", "թխկոց", "թխպած", "թխպել", "թխպոտ", "թխսել", "թխվել", "թղթել", "թղթիկ", "թղթյա", "թմբել", "թմբիկ", "թմբիչ", "թմբիր", "թմրել", "թմփալ", "թնգալ", "թնգոց", "թնդալ", "թնդել", "թնդոց", "թնկոց", "թնչալ", "թշշան", "թշշոց", "թոդան", "թոզոտ", "թողած", "թողել", "թողեց", "թողեք", "թողին", "թողիր", "թողիք", "թոնիր", "թոշակ", "թոռչի", "թովել", "թորալ", "թորած", "թորակ", "թորել", "թորթա", "թորիչ", "թութք", "թուխս", "թուղթ", "թումբ", "թույլ", "թույն", "թույր", "թունդ", "թուրծ", "թպպալ", "թպպոց", "թռանք", "թռիչք", "թռնել", "թռչել", "թսկել", "թսսալ", "թվարկ", "թրախկ", "թրըխկ", "թրըմբ", "թրթիռ", "թրծել", "թրմոց", "թրջել", "թրջոց", "թրքել", "թրքոտ", "թփուտ", "թքանք", "ժաժիկ", "ժնգոց", "ժշխել", "ժողով", "ժպիրհ", "ժպտալ", "իդեալ", "իդիոմ", "իմաստ", "իներտ", "ինչեր", "ինչից", "ինչով", "ինտիմ", "իշիաս", "իշխան", "իշխել", "իշուկ", "իջնել", "իսպառ", "իստակ", "լագան", "լազաթ", "լալան", "լալիկ", "լակել", "լամել", "լայկա", "լայնք", "լանջք", "լաչակ", "լաչառ", "լավաշ", "լավիկ", "լավիտ", "լատին", "լարան", "լարել", "լարիչ", "լացել", "լափել", "լաքել", "լեգալ", "լեզգի", "լեզու", "լեղակ", "լեսան", "լիդեր", "լիմոն", "լինզա", "լինող", "լիրիկ", "լլկել", "լլվել", "լխկալ", "լխկել", "լխպոր", "լխտիկ", "լծկան", "լծկապ", "լծորդ", "լծվել", "լծվոր", "լղճել", "լճեզր", "լմփատ", "լյարդ", "լնգալ", "լոբու", "լողաթ", "լողալ", "լողակ", "լողան", "լողափ", "լոպար", "լոսել", "լոսոց", "լորիկ", "լուլա", "լույս", "լուրթ", "լուրջ", "լոքել", "լպիրծ", "լպիրշ", "լռվել", "լսելի", "լսվել", "լվացք", "լրում", "լրվել", "լրտես", "լցնել", "լցուկ", "լցում", "լցվել", "լփռոտ", "լքում", "լքվել", "խաբար", "խազել", "խաթար", "խաթեր", "խաժակ", "խալաթ", "խալոտ", "խախաց", "խածավ", "խածել", "խաղալ", "խաղաղ", "խաղիկ", "խաղող", "խավիծ", "խավոտ", "խարազ", "խարակ", "խարամ", "խարան", "խարել", "խափան", "խեթել", "խեժոտ", "խելառ", "խելոք", "խեղել", "խեցատ", "խեփոր", "խզզալ", "խզզոց", "խզում", "խզվել", "խթում", "խթվել", "խժժալ", "խժժոց", "խժում", "խժռել", "խժռոց", "խիզան", "խիժոտ", "խիլոտ", "խլախտ", "խլինք", "խլիրդ", "խլնոտ", "խլշել", "խլվակ", "խխմել", "խխում", "խճճել", "խճճոց", "խճուճ", "խմբակ", "խմբել", "խմվել", "խմրել", "խյուս", "խնամի", "խնամք", "խնդալ", "խնդիր", "խնթալ", "խնթոց", "խնկոտ", "խնձոր", "խնոցի", "խնչել", "խնչոց", "խշկել", "խշշալ", "խշշոց", "խշուր", "խշտել", "խշտիկ", "խշտիք", "խշրել", "խոզակ", "խոզան", "խոթել", "խոժոռ", "խոլոռ", "խոլոր", "խոխոմ", "խոխոջ", "խոկալ", "խոհել", "խոհեմ", "խոնչա", "խոշոր", "խոպան", "խոպոպ", "խոռել", "խոսել", "խոսող", "խոտան", "խոտել", "խոտոր", "խոտոց", "խորակ", "խորան", "խորիզ", "խորին", "խորոզ", "խորոմ", "խորով", "խորոտ", "խոցիչ", "խոցոտ", "խումբ", "խույր", "խունկ", "խոփիկ", "խչմար", "խռթալ", "խռթոց", "խռնել", "խռովք", "խռուկ", "խռչակ", "խռպոտ", "խռռալ", "խռռոց", "խռվակ", "խռփալ", "խռփոց", "խստիվ", "խտուտ", "խտտել", "խտրել", "խտրոց", "խրթել", "խրթին", "խրկել", "խրձել", "խրճիթ", "խրոխտ", "խրում", "խրուտ", "խրվել", "խցկել", "խցվել", "խփվել", "ծագել", "ծալել", "ծախել", "ծախու", "ծածան", "ծակել", "ծակիչ", "ծակոտ", "ծակոց", "ծաղիկ", "ծամել", "ծամիկ", "ծամիչ", "ծամոն", "ծամոց", "ծանոթ", "ծավալ", "ծարավ", "ծափիկ", "ծեգել", "ծերատ", "ծերից", "ծեփան", "ծեփել", "ծեփիչ", "ծիծակ", "ծիծաղ", "ծիծառ", "ծիծեռ", "ծիտիկ", "ծիրան", "ծլանգ", "ծլանք", "ծլթալ", "ծլթոց", "ծլինգ", "ծլլալ", "ծլկել", "ծլոնգ", "ծլուլ", "ծլում", "ծխանի", "ծխանք", "ծխնիկ", "ծխուկ", "ծխչոր", "ծխվել", "ծծկան", "ծծկեր", "ծծմոր", "ծծուկ", "ծծվել", "ծկթել", "ծղխնի", "ծղծամ", "ծմրալ", "ծմրոց", "ծնգալ", "ծնգոց", "ծնծղա", "ծնկել", "ծնկոտ", "ծնվել", "ծովակ", "ծովափ", "ծովիկ", "ծորալ", "ծորակ", "ծորան", "ծորել", "ծոցափ", "ծույլ", "ծունկ", "ծուփք", "ծոփոր", "ծպպոց", "ծպտալ", "ծպտել", "ծպտոց", "ծռանց", "ծռում", "ծռվել", "ծրում", "ծրվել", "ծրտել", "ծրտոտ", "ծփանք", "ծփում", "կադետ", "կաթել", "կաթիլ", "կաթոց", "կաթսա", "կալան", "կալոց", "կախան", "կախել", "կախիչ", "կախոց", "կածան", "կակազ", "կական", "կակաո", "կակաչ", "կաղալ", "կաղին", "կաղնի", "կաճառ", "կաճյա", "կամար", "կամաց", "կայան", "կային", "կայիր", "կայիք", "կայսր", "կանալ", "կանաչ", "կանեփ", "կանոն", "կաշառ", "կաշյա", "կաշու", "կապալ", "կապան", "կապառ", "կապար", "կապել", "կապեր", "կապիկ", "կապիչ", "կապոց", "կառան", "կառափ", "կաստա", "կավատ", "կավար", "կավիճ", "կավոտ", "կատակ", "կատար", "կատիկ", "կատու", "կարագ", "կարամ", "կարան", "կարապ", "կարաս", "կարատ", "կարել", "կարիճ", "կարիք", "կարող", "կարոտ", "կացին", "կաքավ", "կաֆել", "կենալ", "կենաց", "կեռաս", "կեռել", "կեռիկ", "կեսար", "կեսօր", "կերոն", "կեցցե", "կզվել", "կթում", "կթվել", "կթվոր", "կիզել", "կիզիչ", "կիթառ", "կիսան", "կիսատ", "կիսել", "կիտել", "կլանչ", "կլիմա", "կլիշե", "կլպել", "կխտար", "կծկել", "կծղել", "կծում", "կծված", "կծվել", "կծվիչ", "կկզել", "կկվիկ", "կղղալ", "կղղոց", "կճճիկ", "կճուճ", "կճպել", "կմախք", "կյանք", "կնկան", "կնձիկ", "կնձնի", "կնճիթ", "կնճիռ", "կնորս", "կնքել", "կշեռք", "կշռակ", "կշռել", "կշռոց", "կոալա", "կոբրա", "կոզակ", "կոթառ", "կոթող", "կոթոց", "կոլոն", "կոլոտ", "կոլոր", "կոխան", "կոխել", "կոծել", "կոծիկ", "կոծոծ", "կոկետ", "կոկիկ", "կոկիչ", "կոկոզ", "կոկոն", "կոկոս", "կոհակ", "կողակ", "կողով", "կոճակ", "կոճատ", "կոմիկ", "կոշիկ", "կոչել", "կոպալ", "կոպար", "կոպեկ", "կոպիճ", "կոպիտ", "կոստղ", "կոտակ", "կոտեմ", "կոտոշ", "կորած", "կորեխ", "կորեկ", "կորիզ", "կորով", "կուլի", "կուլտ", "կուղբ", "կույլ", "կույս", "կույր", "կունդ", "կուշտ", "կուպե", "կուպր", "կուռք", "կուրծ", "կուրս", "կուրտ", "կոփել", "կպնել", "կպում", "կպչան", "կպչել", "կպրիչ", "կպրոտ", "կռածո", "կռելի", "կռզու", "կռթալ", "կռթոց", "կռինչ", "կռճել", "կռճիկ", "կռճոն", "կռնակ", "կռնատ", "կռում", "կռռալ", "կռռոց", "կռվան", "կռվել", "կռտել", "կսկիծ", "կսմիթ", "կտուր", "կտուց", "կտտալ", "կտտել", "կտտոր", "կտրել", "կտրիճ", "կտրիչ", "կտրոն", "կտցար", "կտցել", "կրթել", "կրթիչ", "կրծել", "կրծող", "կրծոն", "կրկես", "կրկին", "կրճատ", "կրճիկ", "կրճոն", "կրում", "կրպակ", "կրվել", "կրտել", "կրքոտ", "կցուկ", "կցում", "կցվել", "կքում", "կքվել", "հաբեշ", "հագագ", "հազալ", "հազար", "հազել", "հազոց", "հալալ", "հալավ", "հալել", "հալիմ", "հախտա", "հածել", "հակակ", "հաճախ", "հաճար", "հաճել", "համակ", "համառ", "համար", "համեղ", "համեմ", "համով", "համփա", "հայել", "հային", "հայոց", "հանաք", "հանել", "հանիկ", "հաշիշ", "հաշիվ", "հաչել", "հաչոց", "հաջող", "հառաչ", "հառաջ", "հառել", "հասած", "հասակ", "հասաս", "հասու", "հասցե", "հավան", "հավաս", "հավատ", "հավար", "հավաք", "հավետ", "հավիկ", "հատած", "հատակ", "հատավ", "հատել", "հատիկ", "հատիչ", "հատով", "հատոր", "հարամ", "հարավ", "հարգո", "հարել", "հարեմ", "հարիչ", "հարոս", "հարոց", "հարու", "հացիկ", "հեզար", "հեզիկ", "հեծան", "հեծել", "հեղել", "հեղեղ", "հենակ", "հենել", "հենոց", "հեռու", "հեսան", "հետին", "հերիք", "հերոս", "հեքիմ", "հիացք", "հիմար", "հինել", "հինիչ", "հիշել", "հիշոց", "հիպատ", "հիջրա", "հիրիկ", "հծծել", "հղկել", "հղկիչ", "հղում", "հղվել", "հմայք", "հմուտ", "հյութ", "հյուղ", "հյուս", "հյուր", "հնածո", "հնաոճ", "հնարք", "հնդիկ", "հնձան", "հնձել", "հնձիչ", "հնուց", "հնչակ", "հնչել", "հնչեղ", "հոգալ", "հոգոց", "հոգվո", "հոդել", "հոժար", "հոլակ", "հոլիկ", "հոլով", "հոկեյ", "հողան", "հողել", "հողոտ", "հոնեղ", "հոշել", "հոպոպ", "հոռոմ", "հոսել", "հովազ", "հովեկ", "հովիկ", "հովիվ", "հովիտ", "հովոց", "հոտած", "հոտաղ", "հոտել", "հոտեր", "հոտից", "հոտով", "հոտոտ", "հորատ", "հորդա", "հորել", "հորից", "հորով", "հումք", "հույզ", "հույլ", "հույն", "հույս", "հունտ", "հուշտ", "հուրի", "հպարտ", "հպում", "հպվել", "հռինդ", "հռչակ", "հսկել", "հսկիչ", "հստակ", "հրաշք", "հրարկ", "հրդեհ", "հրթիռ", "հրկեզ", "հրձիգ", "հրշեջ", "հրում", "ձագար", "ձախող", "ձավար", "ձգանք", "ձգում", "ձգվել", "ձգտել", "ձենով", "ձեռաց", "ձերին", "ձթենի", "ձիագի", "ձիթել", "ձիթոտ", "ձկնիկ", "ձձում", "ձմռան", "ձյութ", "ձյուն", "ձնհալ", "ձնձեղ", "ձողան", "ձողիկ", "ձոնել", "ձորակ", "ձորափ", "ձուղպ", "ձույլ", "ղազախ", "ղազան", "ղալաթ", "ղալամ", "ղալիմ", "ղամիշ", "ղաչաղ", "ղասաբ", "ղարիբ", "ղեղազ", "ղժժալ", "ղժժան", "ղժժոց", "ղժղոց", "ղմմաթ", "ղշլաղ", "ղոնաղ", "ղրկել", "ղրփել", "ճագար", "ճաթել", "ճակատ", "ճահիճ", "ճաղատ", "ճաղար", "ճաղել", "ճամբա", "ճամփա", "ճայակ", "ճայիկ", "ճանառ", "ճանար", "ճաշակ", "ճաշել", "ճաշոց", "ճապաղ", "ճառել", "ճարակ", "ճարել", "ճաքել", "ճգնել", "ճեմել", "ճեպել", "ճեպով", "ճզմել", "ճիլոպ", "ճիճու", "ճիպոտ", "ճիվաղ", "ճիրան", "ճլերք", "ճլզել", "ճլուզ", "ճխլել", "ճխտել", "ճկում", "ճկուն", "ճկռել", "ճկվել", "ճղճիմ", "ճղվել", "ճղփալ", "ճղփոց", "ճմթել", "ճմլել", "ճմլիչ", "ճմլոց", "ճմուտ", "ճմռել", "ճյուղ", "ճնկալ", "ճնկոց", "ճնշակ", "ճնշել", "ճնշիչ", "ճնշող", "ճշտել", "ճշտիվ", "ճոկան", "ճոճալ", "ճոճել", "ճոպան", "ճոռիկ", "ճոռոմ", "ճումբ", "ճչում", "ճպուռ", "ճպռոտ", "ճռզած", "ճռթոց", "ճռինչ", "ճռռալ", "ճռռան", "ճռռոց", "ճռվող", "ճստալ", "ճստիկ", "ճրճիմ", "մագոգ", "մազեղ", "մազոտ", "մաժել", "մախաթ", "մախաղ", "մախոխ", "մածիկ", "մակաղ", "մակաճ", "մական", "մակար", "մակբա", "մակետ", "մահակ", "մահիկ", "մահիճ", "մաղալ", "մաղախ", "մաղել", "մաճար", "մայիս", "մայոր", "մայոց", "մանած", "մանեթ", "մանել", "մանիշ", "մանրե", "մաշել", "մաշիկ", "մաջառ", "մառան", "մասսա", "մասրա", "մատակ", "մատաղ", "մատիկ", "մատիտ", "մարագ", "մարալ", "մարաղ", "մարել", "մացառ", "մաքոք", "մգդակ", "մգլած", "մգլել", "մեդալ", "մեդիա", "մելիք", "մեխակ", "մեխել", "մեկեն", "մեկիկ", "մեղու", "մենակ", "մեռել", "մեռոն", "մեսիա", "մետաղ", "մետրո", "մերան", "մերել", "մերին", "մզում", "մզրախ", "մթերք", "մթնել", "մթնկա", "մժղիկ", "մժուժ", "միազմ", "միաթի", "միաձի", "միացք", "միզել", "միմոս", "մինիկ", "մինոր", "միջակ", "միջատ", "միջել", "միջին", "միջոց", "միսիա", "միտել", "միրաբ", "մլուլ", "մլուկ", "մխում", "մխվել", "մկկալ", "մկկոց", "մկնիկ", "մկնոռ", "մկրատ", "մղլակ", "մղմեղ", "մղորդ", "մղում", "մղվել", "մյուս", "մնջիկ", "մնջոտ", "մշուշ", "մոգել", "մոդել", "մոլար", "մոլլա", "մոլոշ", "մոլոր", "մոծակ", "մողես", "մոմել", "մոմոտ", "մոտիկ", "մոտիվ", "մորեխ", "մորթի", "մորֆի", "մունջ", "մուշկ", "մուսա", "մուտք", "մուրճ", "մռայլ", "մռութ", "մռռալ", "մռռոց", "մսալի", "մսխալ", "մսխել", "մսուր", "մտնել", "մտրակ", "մրկել", "մրուր", "մրսել", "մրտիմ", "մրրիկ", "մրցել", "յաբու", "յուրդ", "նաբաթ", "նազան", "նազար", "նազել", "նազիկ", "նազիր", "նալել", "նալիկ", "նախնի", "նախոր", "նաղաշ", "նամազ", "նամակ", "նամոտ", "նայած", "նայել", "նանիկ", "նավազ", "նավակ", "նավել", "նարդի", "նարոտ", "նաֆաս", "նեխել", "նեխիչ", "նեղել", "նեղիչ", "նետել", "ներել", "ներկա", "նզովք", "նժդեհ", "նիզակ", "նիկել", "նիհար", "նկուղ", "նկուն", "նմուշ", "նյարդ", "նյութ", "ննջալ", "ննջել", "նշելի", "նշենի", "նշխար", "նշմար", "նշում", "նշուտ", "նշվել", "նշտար", "նոթոտ", "նոխազ", "նովել", "նոտար", "նորաճ", "նորել", "նորեկ", "նորին", "նորիք", "նորմա", "նորոգ", "նորոն", "նույն", "նուռն", "նուրբ", "նպաստ", "նռենի", "նռնակ", "նստած", "նստան", "նստավ", "նստար", "նստաք", "նստել", "նստիք", "նստոց", "նվաստ", "նրանց", "նրանք", "նրբին", "շաբաթ", "շաբաշ", "շալախ", "շալակ", "շախտա", "շահել", "շահեն", "շաղալ", "շաղախ", "շաղափ", "շաղել", "շաղիչ", "շաղոտ", "շամամ", "շայկա", "շաչել", "շապիկ", "շառաչ", "շառատ", "շառափ", "շառոտ", "շավաղ", "շավիղ", "շարան", "շարավ", "շարել", "շարոց", "շափաղ", "շափել", "շաքար", "շաքիլ", "շեղաչ", "շեղել", "շերամ", "շերեփ", "շեփոր", "շիթիլ", "շինել", "շիշակ", "շիջել", "շիվան", "շիվար", "շիտակ", "շիրիմ", "շիրոտ", "շլացք", "շլդիկ", "շլինք", "շլմոր", "շլորի", "շլոփա", "շլվել", "շխկալ", "շղարշ", "շմփալ", "շմփոց", "շյուղ", "շնաբն", "շնդող", "շնորհ", "շնչատ", "շնչել", "շնչեղ", "շշմած", "շշմոլ", "շշուկ", "շոգել", "շողալ", "շողակ", "շողիկ", "շողիք", "շողոմ", "շողոտ", "շոյել", "շոյիչ", "շորոր", "շորվա", "շուկա", "շուղա", "շունչ", "շուրթ", "շուրջ", "շռայլ", "շռինդ", "շռռալ", "շվայտ", "շտկել", "շրդան", "շրշալ", "շրշել", "շրշոց", "շրջան", "շրջել", "շրջիկ", "շփերթ", "շփում", "շփվել", "շփփալ", "շքերթ", "շքվել", "ոզնիկ", "ոլոռն", "ոլորտ", "ոլորք", "ոհմակ", "ողբալ", "ողորկ", "ողորմ", "ոմանց", "ոմանք", "ոչինչ", "ոչխար", "ոջլոտ", "ոռնալ", "ոռնոց", "ոսկել", "ոսկյա", "ոսկոր", "ոսպիկ", "ոստան", "ոստիկ", "ոստոտ", "ոստրե", "ովքեր", "ոտկապ", "ոտմաշ", "ոտնակ", "ոտնել", "ոտքել", "որբիկ", "որդան", "որդել", "որդոտ", "որկոր", "որձակ", "որձատ", "որմել", "որոնց", "որոնք", "որչափ", "որպես", "որսալ", "որտեղ", "որքան", "որքին", "ուզել", "ուզող", "ուժակ", "ուժատ", "ուժեղ", "ուլիկ", "ուղեղ", "ուղիղ", "ումից", "ումով", "ունակ", "ունեի", "ունեմ", "ունեն", "ունես", "ուներ", "ունեք", "ուշիմ", "ուշով", "ուռավ", "ուռել", "ուսել", "ուսեղ", "ուստա", "ուստր", "ուտել", "ուտիչ", "ուտիք", "ուտող", "ուրագ", "ուրախ", "ուրան", "ուրար", "ուրիշ", "չադրա", "չաթու", "չալիկ", "չալմա", "չախալ", "չաման", "չամիչ", "չանաղ", "չանաք", "չարիք", "չափել", "չափիչ", "չգտան", "չեզոք", "չեչեն", "չեչոտ", "չթթոց", "չթվոր", "չիբան", "չիլիկ", "չիման", "չինար", "չիփակ", "չլինի", "չխկալ", "չխկոց", "չղջիկ", "չմպալ", "չմտած", "չմփալ", "չմփոց", "չմքել", "չնչին", "չոդառ", "չոմախ", "չոչել", "չոռոտ", "չորել", "չորոց", "չուխա", "չուստ", "չուքա", "չոքել", "չպետք", "չռթել", "չռռալ", "չռվել", "չստիկ", "չվերթ", "չրըխկ", "չրթել", "չքմեղ", "չքնաղ", "չքվել", "պաթոս", "պալատ", "պալար", "պախրա", "պակաս", "պահակ", "պահել", "պահիկ", "պահոց", "պաղել", "պաղիչ", "պաճիճ", "պաճոտ", "պայիկ", "պանիր", "պաշաղ", "պաշար", "պաչել", "պաչիկ", "պապակ", "պապիկ", "պառակ", "պառավ", "պասիվ", "պատան", "պատառ", "պատատ", "պատել", "պատիժ", "պատիճ", "պատիվ", "պատիր", "պատվո", "պարան", "պարապ", "պարել", "պարեխ", "պարեկ", "պարեն", "պարետ", "պարիկ", "պարոն", "պարոր", "պարտք", "պեղել", "պեմզա", "պզուկ", "պզտիկ", "պժգալ", "պիծակ", "պիպիչ", "պիջակ", "պիսակ", "պիտակ", "պլզել", "պլշել", "պլոմբ", "պլուզ", "պղերգ", "պղինձ", "պղծել", "պղծիչ", "պղպեղ", "պղտոր", "պճղել", "պճճալ", "պճնել", "պճռել", "պնդել", "պնդիչ", "պնչատ", "պշկել", "պշում", "պոզատ", "պոլոզ", "պոկել", "պողոճ", "պոչատ", "պոչիկ", "պոպոզ", "պոպոք", "պոռալ", "պոռոչ", "պոռոտ", "պոռոց", "պումա", "պչրել", "պչրոտ", "պպզել", "պստիկ", "պտկել", "պտկիկ", "պտղել", "պտուկ", "պտուղ", "պտուտ", "պտռել", "պտտան", "պտտել", "պրծած", "պրծան", "պրծար", "պրկել", "պրկոց", "պրոզա", "պրուս", "պրտու", "ջահել", "ջահրա", "ջաղաց", "ջանալ", "ջանիկ", "ջեռակ", "ջեռոց", "ջիվան", "ջիրիթ", "ջլախտ", "ջլբաց", "ջլթիկ", "ջլուտ", "ջխտել", "ջհուդ", "ջղախտ", "ջնջել", "ջնջիչ", "ջնջոց", "ջոկատ", "ջոկել", "ջոնկա", "ջուխտ", "ջուրք", "ջրալի", "ջրարբ", "ջրարջ", "ջրբեր", "ջրգող", "ջրդար", "ջրդեղ", "ջրթափ", "ջրթող", "ջրլից", "ջրխոտ", "ջրկից", "ջրհան", "ջրհավ", "ջրհատ", "ջրհոս", "ջրհոր", "ջրոգի", "ջրոսպ", "ջրում", "ջրչոր", "ջրպետ", "ջրսահ", "ջրվար", "ջրվեժ", "ջրվել", "ջրվոր", "ջրտար", "ջրտու", "ջրցան", "ջրցեխ", "ջրցող", "ջրփախ", "ջրփող", "ջրփոս", "ջրքամ", "ռադիո", "ռամիկ", "ռայոն", "ռաշիդ", "ռեզին", "ռեժիմ", "ռելիե", "ռեհան", "ռենտա", "ռետին", "ռոճիկ", "ռունգ", "սագիկ", "սադափ", "սադաֆ", "սազել", "սաժեն", "սալաթ", "սալակ", "սալար", "սալիկ", "սալոն", "սալոր", "սածիլ", "սակառ", "սակավ", "սահել", "սամիթ", "սամիր", "սանիկ", "սապատ", "սապոն", "սառավ", "սառատ", "սառել", "սավան", "սատակ", "սատապ", "սատար", "սատափ", "սատին", "սարած", "սարեկ", "սարիկ", "սափոր", "սգերգ", "սգերթ", "սգվել", "սգվոր", "սեզոն", "սեզոտ", "սեղան", "սենատ", "սեպել", "սեսիա", "սերել", "սերիա", "սերոտ", "սթրել", "սիբեխ", "սիգալ", "սիգար", "սիլոս", "սիմակ", "սիպահ", "սիսեռ", "սիվիտ", "սիրած", "սիրել", "սիրող", "սիրոն", "սիրով", "սլացք", "սլլալ", "սլլան", "սլկել", "սլուլ", "սլվել", "սխեմա", "սխտոր", "սկիզբ", "սկում", "սկսան", "սկսավ", "սկսար", "սկսաք", "սկսել", "սկվել", "սղկել", "սղղալ", "սղղան", "սղում", "սղվել", "սմբակ", "սմքել", "սյուն", "սյուք", "սնանկ", "սնարք", "սնդիկ", "սնկիկ", "սնձան", "սնձնի", "սնոտի", "սնում", "սնչիկ", "սնվել", "սոթոտ", "սոխակ", "սոկաս", "սողալ", "սոմառ", "սոնետ", "սոնիճ", "սոսափ", "սոված", "սովել", "սովետ", "սովոր", "սորալ", "սորել", "սորոր", "սոցապ", "սույն", "սունկ", "սուսր", "սուրբ", "սպանդ", "սպասք", "սպիրտ", "սպորտ", "սռնակ", "սռռալ", "ստեղն", "ստինք", "ստլիկ", "ստվար", "ստվեր", "սրագի", "սրակն", "սրանց", "սրանք", "սրբան", "սրբել", "սրբիչ", "սրիկա", "սրինգ", "սրում", "սրվակ", "սրվել", "սրտիք", "սրտով", "սրտոտ", "սրքան", "սփռել", "սփռոց", "վագոն", "վազան", "վազել", "վաթան", "վախել", "վակաս", "վահան", "վայել", "վայոց", "վանել", "վանիչ", "վառակ", "վառել", "վառեկ", "վառիչ", "վառոդ", "վասալ", "վավաշ", "վարազ", "վարակ", "վարար", "վարել", "վարիչ", "վարձք", "վարոց", "վարսք", "վեզիր", "վեհեր", "վեղար", "վերաճ", "վերին", "վերջի", "վերստ", "վզզալ", "վզզոց", "վզկապ", "վզնոց", "վժժալ", "վժժան", "վժժոց", "վիթել", "վիժակ", "վիժել", "վիլակ", "վիճակ", "վիճել", "վիշապ", "վիպակ", "վիրապ", "վիրոտ", "վխտալ", "վհուկ", "վճռել", "վնգալ", "վնգոց", "վշշալ", "վշշան", "վշշոց", "վշտոտ", "վոկալ", "վուշե", "վռթալ", "վռչալ", "վռչոց", "վռվել", "վսսալ", "վսսոց", "վստահ", "վրացի", "վրձին", "տաբատ", "տալիք", "տածել", "տակառ", "տաղիկ", "տաճար", "տաճիկ", "տամար", "տայգա", "տանգո", "տանել", "տանից", "տանիք", "տանող", "տաշել", "տաշեղ", "տապակ", "տապան", "տապար", "տաջիկ", "տառեխ", "տառեղ", "տավար", "տավիղ", "տատիկ", "տարազ", "տարած", "տարան", "տարավ", "տարար", "տարափ", "տարաք", "տարել", "տարեխ", "տարեց", "տարիք", "տարիֆ", "տափակ", "տափան", "տափել", "տաքսի", "տեղալ", "տեղակ", "տեղիք", "տեմբր", "տեսակ", "տեսավ", "տեսիլ", "տեքստ", "տզզալ", "տզզան", "տզզոց", "տժժալ", "տժժան", "տժժոց", "տիկին", "տիպար", "տիպիկ", "տիտան", "տիտիկ", "տիրել", "տիրող", "տխեղծ", "տխմար", "տխրել", "տկլոր", "տկճոր", "տկռել", "տղմոտ", "տմարդ", "տնանկ", "տնեցի", "տնկել", "տնպահ", "տնվոր", "տնտես", "տնքալ", "տնքոց", "տոլմա", "տոկալ", "տոկոս", "տողան", "տողել", "տոմատ", "տոմար", "տոնել", "տոննա", "տոչոր", "տոպազ", "տոտեմ", "տոտիկ", "տորոն", "տուղտ", "տույժ", "տունկ", "տուտն", "տուրք", "տպվել", "տռզել", "տռճիկ", "տռփալ", "տռփոտ", "տվեցի", "տվինք", "տվյալ", "տրաստ", "տրված", "տրվել", "տրվեց", "տրվող", "տրցակ", "տքնել", "ցածիկ", "ցամաք", "ցայել", "ցայլք", "ցայտք", "ցանել", "ցանիչ", "ցանոտ", "ցանքս", "ցավել", "ցավոտ", "ցաքատ", "ցեխել", "ցեխոտ", "ցերեկ", "ցինիկ", "ցիտատ", "ցմփոր", "ցնդել", "ցնծալ", "ցնորք", "ցնցել", "ցնցիչ", "ցոլալ", "ցոլակ", "ցոլել", "ցողալ", "ցողել", "ցողիկ", "ցորեն", "ցույց", "ցունց", "ցուրտ", "ցռուկ", "ցրդոն", "ցրում", "ցրված", "ցրվել", "ցրտել", "ցրցամ", "ցցհար", "ցցորմ", "ցցում", "ցցչոր", "ցցվել", "ցփնել", "փաթաթ", "փաթեթ", "փաթիլ", "փաթոթ", "փալան", "փալաս", "փախած", "փախան", "փախավ", "փախար", "փախստ", "փական", "փակել", "փակեղ", "փակիչ", "փակոց", "փայակ", "փայել", "փայիկ", "փանաք", "փապար", "փարախ", "փարատ", "փարել", "փարոս", "փարչա", "փափագ", "փափախ", "փեթակ", "փեկոն", "փեշակ", "փետել", "փթթել", "փթռակ", "փլուզ", "փլում", "փլչել", "փլվել", "փխլել", "փխրել", "փղախտ", "փնչալ", "փնչոց", "փնջել", "փնջիկ", "փշալի", "փշշալ", "փշշոց", "փշուտ", "փշուր", "փշտով", "փշրել", "փոթոթ", "փոխան", "փոխել", "փոկել", "փողակ", "փողոտ", "փողոց", "փոճոկ", "փոշոտ", "փոսիկ", "փորակ", "փորել", "փորեղ", "փորիկ", "փորիչ", "փորոք", "փուխր", "փույթ", "փունջ", "փուստ", "փուքս", "փոփոլ", "փչում", "փչվել", "փռենի", "փռում", "փռվել", "փսիաթ", "փսխել", "փստալ", "փտնել", "փտում", "փրենի", "փրթել", "փրթիկ", "փրկել", "փրկիչ", "փրչոտ", "փքալի", "փքախտ", "փքանք", "փքում", "փքվել", "քաթան", "քակել", "քաղաք", "քաղել", "քաղիկ", "քաղոց", "քամել", "քամիչ", "քամոտ", "քայլք", "քանակ", "քանիս", "քանոն", "քաչալ", "քավել", "քավոր", "քարաղ", "քարափ", "քարել", "քարյա", "քարոզ", "քացախ", "քելեխ", "քերել", "քերիչ", "քերծե", "քերոց", "քեֆով", "քթթել", "քիմիա", "քիմոն", "քիսիկ", "քիրմա", "քլթոց", "քղանց", "քմայք", "քնախտ", "քնարբ", "քներգ", "քնկոտ", "քնձոտ", "քննել", "քննիչ", "քնջիթ", "քշպել", "քշվել", "քշտել", "քոզառ", "քոթակ", "քոլիկ", "քոլոզ", "քոշակ", "քոչոր", "քոսակ", "քոսոտ", "քորդա", "քորել", "քորիչ", "քորոց", "քուլա", "քույր", "քունգ", "քունք", "քուչի", "քուսպ", "քուրձ", "քուրմ", "քուրք", "քչվոր", "քջուջ", "քջջել", "քսուք", "քսվել", "քստոտ", "քվոտա", "քրջոտ", "քցում", "օդուժ", "օթյակ", "օժտել", "օծում", "օծվել", "օնիքս", "օպերա", "օրբիտ", "օրենք", "օրհաս", "օրրան", "ֆագոտ", "ֆալակ", "ֆալչի", "ֆանզա", "ֆասադ", "ֆետիշ", "ֆինիշ", "ֆիշկա", "ֆիրմա", "ֆլորա", "ֆշշալ", "ֆշշան", "ֆշշոց", "ֆոլգա", "ֆուգա", "ֆռռալ", "ֆսսալ", "ֆսսոց", "ֆրենչ", "ֆրթոց", "ֆրոնտ"
]

const ansiSymbolMap = [];
const unicodeSymbolMap = [];

for (let i = 178; i <= 252; i += 2) {
    //uppercase
    ansiSymbolMap.push(i);
    unicodeSymbolMap.push(1328 + (i - 176) / 2);

    //lowercase
    ansiSymbolMap.push(i + 1);
    unicodeSymbolMap.push(1376 + (i - 176) / 2);
}

const customsMap = [{
    //և
    ansi: 168,
    unicode: 0x587,
}, {
    //•
    ansi: 183,
    unicode: 8226,
}, {
    //գ
    ansi: 8226,
    unicode: 1379,
}, {
    //՚
    ansi: 39,
    unicode: 0x55A,
}, {
    //՛
    ansi: 176,
    unicode: 0x55B
}, {
    //՜
    ansi: 175,
    unicode: 0x55C
}, {
    //՝
    ansi: 170,
    unicode: 0x55D
}, {
    //՞
    ansi: 177,
    unicode: 0x55E
}, {
    //։
    ansi: 163,
    unicode: 0x589
}, {
    //֊
    ansi: 173,
    unicode: 0x58A
}, {
    //«
    ansi: 167,
    unicode: 0xAB
}, {
    //»
    ansi: 166,
    unicode: 0xBB
}, {
    //,
    ansi: 171,
    unicode: 0x2C
}, {
    //.
    ansi: 169,
    unicode: 0x2E
}, {
    //…
    ansi: 174,
    unicode: 0x2026
}];
for (let custom of customsMap) {
    ansiSymbolMap.push(custom.ansi);
    unicodeSymbolMap.push(custom.unicode);
}

const WORD_LENGTH = 5
const FLIP_ANIMATION_DURATION = 500
const DANCE_ANIMATION_DURATION = 500
const keyboard = document.querySelector("[data-keyboard]")
const alertContainer = document.querySelector("[data-alert-container]")
const guessGrid = document.querySelector("[data-guess-grid]")
const offsetFromDate = new Date(2022, 0, 1)
const msOffset = Date.now() - offsetFromDate
const dayOffset = msOffset / 1000 / 60 / 60 / 24
const targetWord = targetWords[Math.floor(dayOffset)]
startInteraction()

function startInteraction() {
  document.addEventListener("click", handleMouseClick)
  document.addEventListener("keydown", handleKeyPress)
}

function stopInteraction() {
  document.removeEventListener("click", handleMouseClick)
  document.removeEventListener("keydown", handleKeyPress)
}

function handleMouseClick(e) {
  if (e.target.matches("[data-key]")) {
    console.error("sdqsdsqd")
    pressKey(e.target.dataset.key,true)
    return
  }

  if (e.target.matches("[data-enter]")) {
    submitGuess()
    return
  }

  if (e.target.matches("[data-deleter]")) {
    deleteKey()
    return
  }
}

function handleKeyPress(e) {
  if (e.key === "Enter") {
    submitGuess()
    return
  }

  if (e.key === "Backspace" || e.key === "Delete") {
    deleteKey()
    return
  }

  if (e.key.match(/^[a-z]$/)) {
    pressKey(e.key)
    return
  }
}

 function pressKey(key,click = false) {
  const keyConverter = converter(key);
  // translate.engine = "deepl";
  // translate.key = process.env.DEEPL_KEY;
  const activeTiles = getActiveTiles()
  if (activeTiles.length >= WORD_LENGTH) return
  const nextTile = guessGrid.querySelector(":not([data-letter])")
  console.log("keyConverter", keyConverter)
  console.log("click", click)
  nextTile.dataset.letter = key.toLowerCase()
  nextTile.textContent = click ? key  : keyConverter
  nextTile.dataset.state = "active"
}


function deleteKey() {
  const activeTiles = getActiveTiles()
  const lastTile = activeTiles[activeTiles.length - 1]

  if (lastTile == null) return
  lastTile.textContent = ""
  delete lastTile.dataset.state
  delete lastTile.dataset.letter
}

function converter(key){

  if(key === "a"){
    return "ա"
  }else if(key === "b"){
    return "բ"
  }else if(key === "g"){
    return "գ"
  }else if(key === "d"){
    return "դ"
  }else if(key === "e"){
    return "ե"
  }else if(key === "z"){
    return "զ"
  }else if(key === "e"){
    return "է"
  }else if(key === "@"){
    return "ը"
  }else if(key === "t"){
    return "թ"
  }else if(key === "b"){
    return "b"
  }else if(key === "i"){
    return "ի"
  }else if(key === "l"){
    return "լ"
  }else if(key === "x"){
    return "խ"
  }else if(key === "k"){
    return "կ"
  }else if(key === "h"){
    return "հ"
  }else if(key === "m"){
    return "մ"
  }else if(key === "y"){
    return "յ"
  }else if(key === "b"){
    return "b"
  }else if(key === "n"){
    return "ն"
  }else if(key === "sh"){
    return "շ"
  }else if(key === "o"){
    return "ո"
  }else if(key === "ch"){
    return "չ"
  }else if(key === "p"){
    return "պ"
  }else if(key === "j"){
    return "ջ"
  }else if(key === "r"){
    return "ռ"
  }else if(key === "s"){
    return "ս"
  }else if(key === "v"){
    return "վ"
  }else if(key === "t"){
    return "տ"
  }else if(key === "r"){
    return "ր"
  }else if(key === "c"){
    return "ց"
  }else if(key === "u"){
    return "ու"
  }else if(key === "ph"){
    return "փ"
  }else if(key === "q"){
    return "ք"
  }else if(key === "ev"){
    return "և"
  }else if(key === "o"){
    return "o"
  }else if(key === "f"){
    return "ֆ"
  }
    
}

function submitGuess() {
  const activeTiles = [...getActiveTiles()]
  if (activeTiles.length !== WORD_LENGTH) {
    showAlert("Ոչ բավարար տառեր")
    shakeTiles(activeTiles)
    return
  }

  const guess = activeTiles.reduce((word, tile) => {
    return word + tile.dataset.letter
  }, "")

  if (!targetWords.includes(guess)) {
    showAlert("Բառը չի գտնվում ցանկում")
    shakeTiles(activeTiles)
    return
  }

  stopInteraction()
  activeTiles.forEach((...params) => flipTile(...params, guess))
}

function flipTile(tile, index, array, guess) {
  const letter = tile.dataset.letter
  const key = keyboard.querySelector(`[data-key="${letter}"i]`)
  setTimeout(() => {
    tile.classList.add("flip")
  }, (index * FLIP_ANIMATION_DURATION) / 2)

  tile.addEventListener(
    "transitionend",
    () => {
      tile.classList.remove("flip")
      if (targetWord[index] === letter) {
        tile.dataset.state = "correct"
        key.classList.add("correct")
      } else if (targetWord.includes(letter)) {
        tile.dataset.state = "wrong-location"
        key.classList.add("wrong-location")
      } else {
        tile.dataset.state = "wrong"
        key.classList.add("wrong")
      }

      if (index === array.length - 1) {
        tile.addEventListener(
          "transitionend",
          () => {
            startInteraction()
            checkWinLose(guess, array)
          },
          { once: true }
        )
      }
    },
    { once: true }
  )
}

function getActiveTiles() {
  return guessGrid.querySelectorAll('[data-state="active"]')
}

function showAlert(message, duration = 1000) {
  const alert = document.createElement("div")
  alert.textContent = message
  alert.classList.add("alert")
  alertContainer.prepend(alert)
  if (duration == null) return

  setTimeout(() => {
    alert.classList.add("hide")
    alert.addEventListener("transitionend", () => {
      alert.remove()
    })
  }, duration)
}

function shakeTiles(tiles) {
  tiles.forEach(tile => {
    tile.classList.add("shake")
    tile.addEventListener(
      "animationend",
      () => {
        tile.classList.remove("shake")
      },
      { once: true }
    )
  })
}

function checkWinLose(guess, tiles) {

  if (guess === targetWord) {
    showAlert("Դու հաղթեցիր", 5000)
    danceTiles(tiles)
    stopInteraction()
    return
  }

  const remainingTiles = guessGrid.querySelectorAll(":not([data-letter])")
  if (remainingTiles.length === 0) {
    showAlert(targetWord.toUpperCase(), null)
    stopInteraction()
  }
}

function danceTiles(tiles) {
  tiles.forEach((tile, index) => {
    setTimeout(() => {
      tile.classList.add("dance")
      tile.addEventListener(
        "animationend",
        () => {
          tile.classList.remove("dance")
        },
        { once: true }
      )
    }, (index * DANCE_ANIMATION_DURATION) / 5)
  })
}
